In [12]:
import pandas as pd
import numpy as np
from pandas.io.json import json_normalize
import json

In [6]:
df = pd.read_csv("../data/raw/data_set_phase1/train_plans.csv")

In [7]:
df.shape

(491054, 3)

In [8]:
df.plans = df.apply(lambda x:
                    json.loads('{"plans":' + x.plans + ',"sid":"' + str(x.sid) + '"' + ',"plan_time":' + 
                               '"' + str(x.plan_time) + '"}'), axis=1)

In [9]:
df_unstacked = json_normalize(df.plans.values, 'plans', ['sid', 'plan_time'])

In [10]:
df_unstacked.head()

   distance   eta  price  transport_mode      sid            plan_time
0     32303  5087    600               9  1709112  2018-11-04 11:45:04
1     33678  3149                      3  1709112  2018-11-04 11:45:04
2     33678  3269  10000               4  1709112  2018-11-04 11:45:04
3     32099  5996    600               2  1709112  2018-11-04 11:45:04
4     30446  6494    900               1  1709112  2018-11-04 11:45:04

In [11]:
df_unstacked.shape

(2276822, 6)

In [22]:
tmp = pd.read_pickle("../data/processed/df_train.pickle")

In [23]:
tmp.shape

(2101060, 15)

In [24]:
tmp.head()

,sid,click_time,click_mode,distance_plan,eta,price,transport_mode,plan_time,pid,req_time,o_long,o_lat,d_long,d_lat,distance_query
0,2848914,2018-11-17 18:42:17,1,53156,6456,700.0,1,2018-11-17 12:56:15,101804.0,2018-11-17 12:56:15,116.36,40.07,116.00,40.35,43.656570
1,2848914,2018-11-17 18:42:17,1,48112,3535,700.0,3,2018-11-17 12:56:15,101804.0,2018-11-17 12:56:15,116.36,40.07,116.00,40.35,43.656570
2,2848914,2018-11-17 18:42:17,1,48112,3655,16500.0,4,2018-11-17 12:56:15,101804.0,2018-11-17 12:56:15,116.36,40.07,116.00,40.35,43.656570
3,2848914,2018-11-17 18:42:17,1,51641,8871,1200.0,1,2018-11-17 12:56:15,101804.0,2018-11-17 12:56:15,116.36,40.07,116.00,40.35,43.656570
4,2629085,2018-10-12 16:28:13,3,13207,2790,400.0,9,2018-10-12 16:27:55,203797.0,2018-10-12 16:27:55,116.35,40.08,116.33,40.03,5.808139

In [25]:
df_test = pd.read_pickle("../data/processed/df_test.pickle")

In [26]:
df_test.shape

(429803, 13)

In [27]:
df_test.head()

,distance_plan,eta,price,transport_mode,sid,plan_time,pid,req_time,o_long,o_lat,d_long,d_lat,distance_query
0,465,418,700.0,5,1112456,2018-12-05 17:39:47,NaN,2018-12-05 17:39:47,116.45,39.92,116.45,39.92,0.000000
1,465,140,700.0,6,1112456,2018-12-05 17:39:47,NaN,2018-12-05 17:39:47,116.45,39.92,116.45,39.92,0.000000
2,462,178,700.0,3,1112456,2018-12-05 17:39:47,NaN,2018-12-05 17:39:47,116.45,39.92,116.45,39.92,0.000000
3,28846,4779,600.0,2,1413458,2018-12-06 17:49:17,204326.0,2018-12-06 17:49:17,116.50,39.93,116.52,39.79,15.638394
4,18743,3098,700.0,3,1413458,2018-12-06 17:49:17,204326.0,2018-12-06 17:49:17,116.50,39.93,116.52,39.79,15.638394